using System.Linq;
using ReferencesInfo.Entities;

namespace ReferencesInfo.Data {
    public partial class DataContext {
        //Книги
        private void CreateBooks() {
            Books.Add(new Book("Фізика", 2018, 150) {
                Id = 1,
                Illustration = true,
                Description = "Фізика — природнича наука, яка досліджує загальні властивості матерії та явищ у ній, а також виявляє загальні закони, які керують цими явищами. Це наука про закономірності природи в широкому сенсі цього слова.",
                Content = "Магнітне поле. Світлові явища. Механічні та електромагнітні хвилі. Фізика атома та атомного ядра. Рух і взаємодія."
            });
            Books.Add(new Book("Досконалий код", 2010, 889) {
                Id = 2,
                Illustration = true,
                Description = "Більше 10 років перше видання цієї книги вважалося одним з кращих практичних посібників з програмування. Зараз ця книга повністю оновлена з урахуванням сучасних тенденцій і технологій і доповнена сотнями нових прикладів, що ілюструють мистецтво і науку програмування.",
                Content = "Класи. Високоякісні методи. Захисне програмування. Процес програмування з псевдокодом. Загальні принципи використання змінних. Сила імен змінних. Основні типи даних. Нестандартні типи даних",
            });
            Books.Add(new Book("Схемотехніка", 2007, 300) {
                Id = 3,
                Illustration = true,
                Content = "1.Форми зображення інформації 2.Логічні основи схемотехніки ЕОМ 3.Схемотехніка цифрових елементів 4.Схемотехніка комбінаційних вузлів",
                Description = "В підручнику наведені форми зображення інформації, логічні основи схемотехніки ЕОМ, схемотехніка цифрових елементів, схемотехніка комбінаційних вузлів, схемотехніка цифрових вузлів, схемотехніка обслуговуючих елементів, схемотехніка аналогових та комбінаторних вузлів, схемотехніка мікроконтролерів та запам’ятовуючих пристроїв."
            });
            Books.Add(new Book("Мандри Гуллівера", 1726, 343) {
                Id = 4,
                Illustration = false,
                Content = "Частина 1. Подорож до Ліліпутії Частина 2. Подорож до Бробдінгнегу Частина 3. Подорож до Лапути, Белнібарбі, Лаггнегг, Глаббдобдріб та Японії Частина 4. Подорож в країну гуїгнгнмів",
                Description = "Cатирико-фантастична книга Джонатана Свіфта, в якій яскраво і дотепно висміюються людські та суспільні вади й реалії того часу."
            });
            Books.Add(new Book("Економіка", 1999, 300) {
                Id = 5,
                Description = "Економіка або економічні науки — комплекс суспільних наукових дисциплін про господарство, а саме: виробництво, розподіл і споживання товарів та послуг."
            });
            Books.Add(new Book("Історія України 9 клас", 2018, 343) {
                Id = 6,
                Content = "Найдавніші часи. Середньовіччя. Нова доба. Національне відродження. Державність."
            });
        }

        //Посилання
        private void CreateLinks() {
            Links.Add(new Link("Транзистори", Books.First(e =>
            e.Name == "Схемотехніка"), 23) {
                Id = 1,
                Note = "Польові"
            });
            Links.Add(new Link("Програмування", Books.First(e =>
            e.Name == "Досконалий код"), 308) {
                Id = 2,
                Note = "ООП"
            });
            Links.Add(new Link("Електроніка", Books.First(e =>
            e.Name == "Схемотехніка"), 209) {
                Id = 3,
                Note = "Логічні функції та способи їх завдання"
            });
            Links.Add(new Link("Ліліпутія", Books.First(e =>
            e.Name == "Мандри Гуллівера"), 46) {
                Id = 4,
            });
            Links.Add(new Link("Термодинаміка", Books.First(e =>
            e.Name == "Фізика"), 100) {
                Id = 5,
            });
            Links.Add(new Link("Резистори", Books.First(e =>
            e.Name == "Схемотехніка"), 165) {
                Id = 6,
            });
            Links.Add(new Link("Структура коду", Books.First(e =>
            e.Name == "Досконалий код"), 199) {
                Id = 7,
                Note = "Відступи"
            });
            Links.Add(new Link("Світло", Books.First(e =>
            e.Name == "Фізика"), 46) {
                Id = 8,
                Note = "Оптичні прилади"
            });
        }
    }
}
